[
  {
  "id": "1",
  "body": "You wake up in dank, dark room with no windows. The walls bleed, crawl and inch themselves around as if they were a collective of catepillars peeling off the fabric of a ficticious shag carpet, controlled by a shared consciousness. Woah. All you see in the room is a small table. You hear the feint sound of music coming from above you.",
  "actions": {
    "look": {
        "up" : "2"
    },
    "climb": {
      "table" : "3"
    },
    "contemplate": {
        "life" : "1a",
        "love" : "1b"
    }
  },
  "objects" : []
  },

{
  "id": "1a",
  "body": "That's way too deep right now man. Jeez, you just woke up in mysterious room... you need to learn about your priorities...",
  "actions": {
    "look": {
        "up" : "2"
    },
    "climb": {
      "table" : "3"
    }
  },
  "objects" : []
  },

  {
  "id": "1b",
  "body": "</3 No one loves you </3",
  "actions": {
    "look": {
        "up" : "2"
    },
    "climb": {
      "table" : "3"
    }
  },
  "objects" : []
  },

{
  "id": "2",
  "body": "#book1 You look up and see a vent above you. It looks like it would fit exactly one human. Like you. One 'you'. The vent fits exactly one unit-'you'",
  "actions": {
    "climb": {
      "table" : "3"
    }
  },
  "objects" : []
},
{
  "id": "3",
  "body": "You scale the table. People say that Mt. Everestt is a life-changing challenge, and that summiting K2 is an incredible physical task... but they have clearly never tried to climb this table. You. are. a. god. You can now reach the vent",
  "actions": {
    "enter": {
       "vent" : "5"
    }
  },
  "objects" : []
},

{
  "id": "5",
  "body": "You enter the dark vent. You feel the walls closing in on you like a python squeezing the life-force from a wee field-mouse. Ahead, you see a dim light of another grate.",
  "actions": {
    "crawl": {
      "forward" : "7"
    },
    "go": {
      "back" : "4"
    }
  },
  "objects" : []
},
{
  "id": "7",
  "body": "As you crawl over the grate, the weak rusty metal gives way. You crash through vent and land face first on the ground, horribly crippling your already sad figure. As you regain your composure you realize that you are in an open hallway. There is a super sexy door in front of you. Its like, super sexy. Like, okay, seriously... picture a door, then picture a sexy door... the door that is in front of you is the sexy door (sexy-door). You see 3 other doors - one to your left (left-door), one to your right (right-door) and one directly behind (back-door). There is also probably a sexy bookcase or something that you could also check out.",
  "actions": {
    "go": {
      "back" : "5"
      "to bookcase" : "28"
    },
    "open": {
      "sexy-door" : "32",
      "right-door" : "21",
      "left-door" : "16",
      "back-door" : "10"
    }
  },
  "objects" : []
},
  {
    "id" : "10",
    "body" : "You are in a room that is empty, save for a wind-chime near the back wall. The sweet, sweet music of #artist1 and #artist2 fill your ears. Oh, this is totally your jam.",
    "actions" : {
      "go" : {
        "back" : "7"
      },
      "move to" : {
        "wind chime" : "11"
      }
    },
    "objects" : []
  },
  {
    "id" : "11",
    "body" : "Boogying in front of the wind chime to the sweet tunes, you notice that it is made up of a simple wooden frame and bunch of mutal tubes hanging from strings. However, as you look closer, you notice that one of the chimes is actually a key.",
    "actions" : {
      "go" : {
        "back" : "7"
      },
      "take" : {
        "key" : "12"
      }
    },
    "objects" : []
  },
  {
    "id" : "12",
    "body" : "You yank the key off the wind chime. Hopefully whoever made it won't mind.",
    "actions" : {
      "go" : {
        "back" : "7"
      }
    },
    "objects" : [
      "key"
    ]
  },
  {
    "id" : "14",
    "body" : "You walk to door 2 and stand in front of it. You hear a faint clicking sound coming from inside.",
    "actions" : {
      "open" : {
        "door" : "16"
      },
      "go" : {
        "back" : "7"
      }
    },
    "objects" : []
  },
  {
  	"id" : "16",
  	"body" : "As you walk in the room, the light from the hallway illuminates a small portion of the completely pitch black room. You see a room swarming with cockroaches that scatter from the light; they cover every surface. The door slams behind you, leaving you in darkness. This is getting waayyy too real, man.",
  	"actions" : {
      "go" : {
        "back" : "7"
      },
      "check" : {
        "walls" : "17"
      },
      "shine" : {
        "flashlight" : "18"
      }
    },
    "objects" : []
  },
  {
    "id" : "17",
    "body" : "You feel along the walls, but it's useless. You can feel cockroaches swarming over and under your hands and you can't feel a thing",
    "actions" : {
      "go" : {
        "back" : "7"
      },
      "shine" : {
        "flashlight" : "18"
      }
    },
    "objects" : []
  },
  {
    "id" : "18",
    "body" : "You shine your flashlight around the room, and everywhere the light touches, the cockroaches scatter. You see a piece of key hanging on a hook on the far wall.",
    "actions" : {
      "approach" : {
        "wall" : "19",
        "key piece" : "19",
        "key" : "19"
      },
      "go" : {
        "back" : "7"
      },
      "take" : {
        "key" : "20"
      },
      "grab" : {
        "key" : "20"
      }
    },
    "objects" : []
  },
  {
    "id" : "19",
    "body" : "you are now standing in front of the key piece. Congratulations. Now take the damn thing.",
    "actions" : {
      "go" : {
        "back" : "7"
      },
      "take" : {
        "key" : "20"
      }
    },
    "objects" : []
  },
  {
    "id" : "20",
    "body" : "you take the piece of key. The cockroaches click in frustration.",
    "actions" : {
      "go" : {
        "back" : "7"
      }
    },
    "objects" : [
      "key"
    ]
  },
  {
    "id" : "21",
    "body" : "You walk up to the third door. Up close you can really see how moldy it is. However owns this place really needs to invest in a housekeeper or an interior decorator or a fire.",
    "actions" : {
      "go" : {
        "back" : "7"
      },
      "open" : {
        "door" : "23"
      }
    },
    "objects" : []
  },
  {
    "id" : "23",
    "body" : "You enter the room and see your friend, #friend , standing in the middle of it. They don't acknowledge you at all, which you think is kind of a d*ck move since you're the only two in here. That is such a #friend thing to do.",
    "actions" : {
      "talk" : {
        "to #friend" : "24"
      },
      "go" : {
        "back" : "7"
      }
    },
    "objects" : []
  },
  {
    "id" : "24",
    "body" : "You walk over to #friend and say 'sup gangstah?' Your friend looks deep into your eyes, straight down into your soul and quietly whispers, 'tell me what my birthdate is in 'birthday is MM/DD/YY' format'. Maybe it's time you made some new friends.",
    "actions" : {
      "answer" : {
        "is #birthday" : "25",
        "birthday2" : "26"
      },
      "go" : {
        "back" : "7"
      }
    },
    "objects" : []
  },
  {
    "id" : "25",
    "body" : "#friend clasps your hand and whispers, 'you remembered'. They then reach their clamy hand into their pocket and give you a key. Yay! Another key!",
    "actions" : {
      "go" : {
        "back" : "7"
      }
    },
    "objects" : [
      "key"
    ]
  },
  {
    "id" : "26",
    "body" : "still doing the soul-staring thing, #friend whispers, 'incorrect'.",
    "actions" : {
      "answer" : {
        "is #birthday" : "25",
        "birthday2" : "26"
      },
      "go" : {
        "back" : "7"
      }
    },
    "objects" : []
  },
  {
    "id" : "28",
    "body" : "You stand in front of the bookcase and see that it has two shelves.",
    "actions" : {
      "check" : {
        "top shelf" : "29",
        "bottom shelf" : "30"
      },
      "go" : {
        "back" : "7"
      }
    },
    "objects" : []
  },
  {
    "id" : "29",
    "body" : "You see two dusty books on the shelves, #book1 and #book2. But nothing else of note.",
    "actions" : {
      "go" : {
        "back" : "28"
      },
      "check" : {
        "bottom shelf" : "30"
      }
    },
    "objects" : []
  },
  {
    "id" : "30",
    "body" : "You see only an old flashlight sitting on the bottom shelf.",
    "actions" : {
      "go" : {
        "back" : "28"
      },
      "check" : {
        "top shelf" : "28"
      },
      "take" : {
        "flashlight" : "31"
      }
    },
    "objects" : []
  },
  {
    "id" : "31",
    "body" : "You pick up the flashlight. It's a bit dusty, but it works!",
    "actions" : {
      "go" : {
        "back" : "7"
      }
    },
    "objects" : [
      "flashlight"
    ]
  },
  {
    "id" : "32",
    "body" : "You walk up to the sexy, but locked, gilded door. You are awed by it's sexiness. You see three different key holes in the door. It looks like you will need three sexy keys to open it.",
    "actions" : {
      "go" : {
        "back" : "7"
      },
      "unlock" : {
        "door" : "34"
      }
    },
    "objects" : []
  },
  {
    "id" : "33",
    "body" : "SUDDENLY! #significant_other TRANSFORMS into #enemy! Your ARCH_NEMESIS! #enemy: 'I knew you'd do anything to get to #significant_other. I was worried you might not make it, but, as always, you exceeded my expectations. Now tell me, have you figured out where we are?",
    "actions" : {
      "say" : {
        "yup" : "35",
        "yes" : "35",
        "no" : "35"
      }
    },
    "objects" : []
  },
  {
    "id" : "34",
    "body" : "You unlock the sexy gilded door, step inside, and the door slams shut and locks behind you. You are now in another dank less-sexy concrete room. There is a pool of water accumulating from a pipe dripping on the ground. You see #significant_other sitting in the middle of the floor gesturing for you to come to them.",
    "actions" : {
      "approach" : {
        "#significant_other" : "33",
        "pipe" : "36"
      }
    },
    "objects" : []
  },
  {
    "id" : "35",
    "body" : "'Well, either way I'm going to tell you', you're evil, evil nemesis said, 'We are in...YOUR MIND! And now I've trapped you here in this dank dream world forever! No doors out of this room!'",
    "actions" : {
      "approach" : {
        "pipe" : "36"
      },
      "punch" : {
        "#enemy" : "37"
      },
      "search" : {
        "room" : "38"
      }
    },
    "objects" : []
  },
  {
    "id" : "36",
    "body" : "You're standing in front of the pipe now. It seems to be leaking quite a bit from the base. It even looks a little loose...maybe a bit of force... luckily your Judo skillz taught you how to kick thangz.",
    "action" : {
      "kick" : {
        "pipe" : "39"
      },
      "search" : {
        "room" : "38"
      },
      "punch" : {
        "#enemy" : "37"
      }
    },
    "objects" : []
  },
  {
    "id" : "37",
    "body" : "Well that was pointless. It's a dreamworld stupid. You just punched a dream. You are really dumb, for real.",
    "action" : {
      "walk" : {
        "to pipe" : "36"
      },
      "search" : {
        "room" : "38"
      }
    },
    "objects" : []
  },
  {
    "id" : "38",
    "body" : "It's still just a concrete room. It's ugly and cold, and there is that stupid dripping pipe in the corner that is getting water everywhere. Seriously, there is a lot of water coming from that pipe.",
    "action" : {
      "walk" : {
        "to pipe" : "36"
      },
      "punch" : {
        "#enemy" : "37"
      }
    },
    "objects" : []
  },
  {
    "id" : "39",
    "body" : "You've kicked the pipe in half! Now water is pouring out of the hole and filling the room. #enemy: 'No! No! What are you doing! Nooooo!' As soon as your face is under water, you suddently wake up. Safe and sound in your bed. The End!(?)",
    "action" : {
        "drop" : {
          "acid" : "40"
        }
      },
    "objects" : []
  },
  {
    "id" : "40",
    "body" : "After ALL of this, you are still slanging rock and drinkin 40's like it waddent nuddin? Are you sure you haven't learned your lesson. Do you really want to keep doing drugs?",
    "action" : {
        "yes" : {
          "please" : "1"
        },
        "no" : {
          "thanks" : "41"
        }
      },
    "objects" : []
  },
  {
    "id" : "41",
    "body" : "Nobody likes a quitter. You lose.",
    "action" : {},
    "objects" : []
  }

]
